ASTE499-Project-JacobMadden/mainCaseDirectory/CFD/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.01";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    1e-3;
        rho             rho;
        rhoInlet        1.225e-1;
    }

    outlet
    {
        type            matchedFlowRateOutletVelocity;
        inletPatch      inlet;
        value           uniform (0 0 0);
    }

    wall
    {
        type            noSlip;
    }

}

// ************************************************************************* //
