ASTE499-Project-JacobMadden/mainCaseDirectory/CFD/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.01";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedFluxPressure;
        phi             phi;
        //type            zeroGradient;
        //value           $internalField;
    }
    
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    wall
    {
        type            fixedFluxPressure;
        phi             phi;
        //type            zeroGradient;
        //value           $internalField;
    }


}

// ************************************************************************* //
