ASTE499-Project-JacobMadden/mainCaseDirectory/CFD/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.01";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform     1.5; // 0.375;

boundaryField
{

    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
        
        //type            turbulentIntensityKineticEnergyInlet;
        //intensity       0.01;
        //value           $internalField;
    }
    
    outlet
    {
        type            zeroGradient;

        //type            inletOutlet;
        //inletValue      $internalField;
        //value           $internalField;
    }    
    
    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
