ASTE499-Project-JacobMadden/mainCaseDirectory/CFD/system/decomposeParDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM                                                 |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/

// Defines the domain decomposition parameters for the CFD domain,
// for use in the parallel MPI run

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  8; //updated to correspond with correct # processors as set in parDEMrun.sh and parCFDDEMrun.sh

//- Keep owner and neighbour on same processor for faces in zones:
// preserveFaceZones (heater solid1 solid3);

method          hierarchical;

simpleCoeffs
{
    n           (4 1 2);
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (4 1 2);
    delta       0.001;
    order       xyz;
}


manualCoeffs
{
    dataFile    "decompositionData";
}


//// Is the case distributed
//distributed     yes;
//// Per slave (so nProcs-1 entries) the directory above the case.
//roots           
//(
//    "/tmp"
//    "/tmp"
//);


// ************************************************************************* //
